''' 2. Сформувати функцію для обчислення цифрового кореню натурального числа.
Цифровий корінь отримується наступним чином: необхідно скласти всі цифри заданого
числа, потім скласти всі цифри знайденої суми і повторювати процес до тих пір, поки
сума не буде дорівнювати однозначному числу, що і буде цифровим коренем заданого
числа.Рекурсивний метод
Серебренников Дмитрий'''
import timeit
def b(a):#рекурсивная сумма
    if a<=9:
        return a
    else:
        return b(a//10)+a%10
def c(a):#Проверка является ли число однозначным числом
    if a<=9:
        return a
    else:
        return c(b(a))
n=int(input())
print(c(n))
t=timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)
print(f'Program worked {t} seconds')

'''Время: 30-45мин
Код читабельный
Это случай когда рекурсия только ухудшает код, и итериционный способ занимает ГОРАЗДО меньше памяти'''
