''' 2. Сформувати функцію для обчислення цифрового кореню натурального числа.
Цифровий корінь отримується наступним чином: необхідно скласти всі цифри заданого
числа, потім скласти всі цифри знайденої суми і повторювати процес до тих пір, поки
сума не буде дорівнювати однозначному числу, що і буде цифровим коренем заданого
числа.Ітераційний метод
Серебренников Дмитрий'''
import timeit
def b(a):#Функция для суммы
    c=0
    if a<=9:
        return a
    else:
       while a>10:  
           c += a % 10
           a //= 10
           a+=c
       return a
d=int(input())
print(b(d))
t = timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)
print(f'Program worked {t} seconds')

'''Написание:15мин
Читабельность: лучше'''
